C++/objectfactory.org
#+TITLE: A C++ Object Factory

* Introduction

  In object oriented programming, it is very common to have a scenario
  where a large number of classes share the same base class and the
  particular implementation needs to be created at runtime based on
  some specific parameters, for example a class name held in a
  string. Standard C++ does not provide the same type of reflection
  mechanism that other languages use to achieve this, such as C#:

#+BEGIN_SRC java
  System.Reflection.Assembly.GetExecutingAssembly()
        .CreateInstance(string className)
#+END_SRC

  or in java:

#+BEGIN_SRC java
  Class.forName(className).getConstructor(String.class).newInstance(arg);
#+END_SRC

  However, C++ does not allow us to do such things; we have to come up
  with another solution. The basic pattern, or set of patterns, that
  help us achieve this are factory patterns.

* A Simple Solution

** The Base Class

   Our base class is defined as an abstract class as follows:

#+BEGIN_SRC cpp +n -r
  #ifndef CPPFACTORY_MYBASECLASS_H
  #define CPPFACTORY_MYBASECLASS_H

  class MyBaseClass
  {
  public:
          virtual ~MyBaseClass(){}
          virtual void doSomething() = 0;
  };

  #endif // CPPFACTORY_MYBASECLASS_H
#+END_SRC

** The Factory Class

   A factory method can then be defined as a static method that can be
   used to create instances of MyBaseClass. We could define this as a
   static method on MyBaseClass itself, although it is generally good
   practice in object oriented development that a class serves a
   single purpose. Therefore, lets create a factory class:

#+BEGIN_SRC cpp +n -r
  #ifndef CPPFACTORY_MYFACTORY_H
  #define CPPFACTORY_MYFACTORY_H

  #include "MyBaseClass.h"
  #include <memory>
  #include <string>

  using namespace std;

  class MyFactory
  {
  public:
          static shared_ptr<MyBaseClass> CreateInstance(string name);
  };


  #endif // CPPFACTORY_MYFACTORY_H
#+END_SRC

   The factory method is expected to create an instance of a class
   named name that is derived from MyBaseClass and return it as a
   shared pointer, as it will relinquish ownership of the object to
   the caller. We shall return to the implementation of the method
   shortly.

** Some Derived Classes

#+BEGIN_SRC cpp +n -r
  #ifndef CPPFACTORY_DERIVEDCLASSONE_H
  #define CPPFACTORY_DERIVEDCLASSONE_H

  #include "MyBaseClass.h"
  #include <iostream>
  using namespace std;

  class DerivedClassOne : public MyBaseClass
  {
  public:
          DerivedClassOne(){};
          virtual ~DerivedClassOne(){};

          virtual void doSomething() { cout << "I am class one" << endl; }
  };

  #endif // CPPFACTORY_DERIVEDCLASSONE_H
#+END_SRC

   and

#+BEGIN_SRC cpp +n -r
  #ifndef CPPFACTORY_DERIVEDCLASSTWO_H
  #define CPPFACTORY_DERIVEDCLASSTWO_H

  #include "MyBaseClass.h"
  #include <iostream>
  using namespace std;

  class DerivedClassTwo : public MyBaseClass
  {
  public:
          DerivedClassTwo(){};
          virtual ~DerivedClassTwo(){};

          virtual void doSomething() { cout << "I am class two" << endl; }
  };

  #endif // CPPFACTORY_DERIVEDCLASSTWO_H
#+END_SRC

