C++/objectfactory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>A C++ Object Factory</title>
<!-- 2016-01-23 Sat 16:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">A C++ Object Factory</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">A Simple Solution</a>
<ul>
<li><a href="#sec-2-1">The Base Class</a></li>
<li><a href="#sec-2-2">The Factory Class</a></li>
<li><a href="#sec-2-3">Some Derived Classes</a></li>
<li><a href="#sec-2-4">A First Attempt at the Factory Method</a></li>
<li><a href="#sec-2-5">Running the Application</a></li>
</ul>
</li>
<li><a href="#sec-3">Problems with the Simple Solution</a></li>
<li><a href="#sec-4">A Revised Factory Class</a></li>
<li><a href="#sec-5">We can do Better</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
In object oriented programming, it is very common to have a scenario
where a large number of classes share the same base class and the
particular implementation needs to be created at runtime based on
some specific parameters, for example a class name held in a
string. Standard C++ does not provide the same type of reflection
mechanism that other languages use to achieve this, such as C#:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #2aa198;">System</span>.<span style="color: #2aa198;">Reflection</span>.<span style="color: #2aa198;">Assembly</span>.GetExecutingAssembly()
      .CreateInstance(<span style="color: #b58900;">string</span> <span style="color: #268bd2;">className</span>)
</pre>
</div>

<p>
or in java:
</p>

<div class="org-src-container">

<pre class="src src-java">Class.forName(className).getConstructor(String.<span style="color: #859900;">class</span>).newInstance(arg);
</pre>
</div>

<p>
However, C++ does not allow us to do such things; we have to come up
with another solution. The basic pattern, or set of patterns, that
help us achieve this are factory patterns.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">A Simple Solution</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">The Base Class</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Our base class is defined as an abstract class as follows:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr"> 1: </span><span style="color: #cb4b16;">#if</span><span style="color: #cb4b16;">n</span><span style="color: #cb4b16;">def</span> CPPFACTORY_MYBASECLASS_H
<span class="linenr"> 2: </span><span style="color: #cb4b16;">#define</span> <span style="color: #268bd2;">CPPFACTORY_MYBASECLASS_H</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">MyBaseClass</span>
<span class="linenr"> 5: </span>{
<span class="linenr"> 6: </span><span style="color: #859900;">public</span>:
<span class="linenr"> 7: </span>        <span style="color: #859900;">virtual</span> ~<span style="color: #268bd2;">MyBaseClass</span>(){}
<span class="linenr"> 8: </span>        <span style="color: #859900;">virtual</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">doSomething</span>() = 0;
<span class="linenr"> 9: </span>};
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #cb4b16;">#endif</span> <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">CPPFACTORY_MYBASECLASS_H</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">The Factory Class</h3>
<div class="outline-text-3" id="text-2-2">
<p>
A factory method can then be defined as a static method that can be
used to create instances of MyBaseClass. We could define this as a
static method on MyBaseClass itself, although it is generally good
practice in object oriented development that a class serves a
single purpose. Therefore, lets create a factory class:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">12: </span><span style="color: #cb4b16;">#if</span><span style="color: #cb4b16;">n</span><span style="color: #cb4b16;">def</span> CPPFACTORY_MYFACTORY_H
<span class="linenr">13: </span><span style="color: #cb4b16;">#define</span> <span style="color: #268bd2;">CPPFACTORY_MYFACTORY_H</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">"MyBaseClass.h"</span>
<span class="linenr">16: </span><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">&lt;memory&gt;</span>
<span class="linenr">17: </span><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">&lt;string&gt;</span>
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #859900;">using</span> <span style="color: #859900;">namespace</span> <span style="color: #2aa198;">std</span>;
<span class="linenr">20: </span>
<span class="linenr">21: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">MyFactory</span>
<span class="linenr">22: </span>{
<span class="linenr">23: </span><span style="color: #859900;">public</span>:
<span class="linenr">24: </span>        <span style="color: #859900;">static</span> <span style="color: #b58900;">shared_ptr</span>&lt;MyBaseClass&gt; <span style="color: #268bd2;">CreateInstance</span>(<span style="color: #b58900;">string</span> <span style="color: #268bd2;">name</span>);
<span class="linenr">25: </span>};
<span class="linenr">26: </span>
<span class="linenr">27: </span>
<span class="linenr">28: </span><span style="color: #cb4b16;">#endif</span> <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">CPPFACTORY_MYFACTORY_H</span>
</pre>
</div>

<p>
The factory method is expected to create an instance of a class
named name that is derived from MyBaseClass and return it as a
shared pointer, as it will relinquish ownership of the object to
the caller. We shall return to the implementation of the method
shortly.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Some Derived Classes</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">29: </span><span style="color: #cb4b16;">#if</span><span style="color: #cb4b16;">n</span><span style="color: #cb4b16;">def</span> CPPFACTORY_DERIVEDCLASSONE_H
<span class="linenr">30: </span><span style="color: #cb4b16;">#define</span> <span style="color: #268bd2;">CPPFACTORY_DERIVEDCLASSONE_H</span>
<span class="linenr">31: </span>
<span class="linenr">32: </span><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">"MyBaseClass.h"</span>
<span class="linenr">33: </span><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">&lt;iostream&gt;</span>
<span class="linenr">34: </span><span style="color: #859900;">using</span> <span style="color: #859900;">namespace</span> <span style="color: #2aa198;">std</span>;
<span class="linenr">35: </span>
<span class="linenr">36: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">DerivedClassOne</span> : <span style="color: #859900;">public</span> <span style="color: #b58900;">MyBaseClass</span>
<span class="linenr">37: </span>{
<span class="linenr">38: </span><span style="color: #859900;">public</span>:
<span class="linenr">39: </span>        <span style="color: #268bd2;">DerivedClassOne</span>(){};
<span class="linenr">40: </span>        <span style="color: #859900;">virtual</span> ~<span style="color: #268bd2;">DerivedClassOne</span>(){};
<span class="linenr">41: </span>
<span class="linenr">42: </span>        <span style="color: #859900;">virtual</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">doSomething</span>() { cout &lt;&lt; <span style="color: #2aa198;">"I am class one"</span> &lt;&lt; endl; }
<span class="linenr">43: </span>};
<span class="linenr">44: </span>
<span class="linenr">45: </span><span style="color: #cb4b16;">#endif</span> <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">CPPFACTORY_DERIVEDCLASSONE_H</span>
</pre>
</div>

<p>
and
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">46: </span><span style="color: #cb4b16;">#if</span><span style="color: #cb4b16;">n</span><span style="color: #cb4b16;">def</span> CPPFACTORY_DERIVEDCLASSTWO_H
<span class="linenr">47: </span><span style="color: #cb4b16;">#define</span> <span style="color: #268bd2;">CPPFACTORY_DERIVEDCLASSTWO_H</span>
<span class="linenr">48: </span>
<span class="linenr">49: </span><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">"MyBaseClass.h"</span>
<span class="linenr">50: </span><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">&lt;iostream&gt;</span>
<span class="linenr">51: </span><span style="color: #859900;">using</span> <span style="color: #859900;">namespace</span> <span style="color: #2aa198;">std</span>;
<span class="linenr">52: </span>
<span class="linenr">53: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">DerivedClassTwo</span> : <span style="color: #859900;">public</span> <span style="color: #b58900;">MyBaseClass</span>
<span class="linenr">54: </span>{
<span class="linenr">55: </span><span style="color: #859900;">public</span>:
<span class="linenr">56: </span>        <span style="color: #268bd2;">DerivedClassTwo</span>(){};
<span class="linenr">57: </span>        <span style="color: #859900;">virtual</span> ~<span style="color: #268bd2;">DerivedClassTwo</span>(){};
<span class="linenr">58: </span>
<span class="linenr">59: </span>        <span style="color: #859900;">virtual</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">doSomething</span>() { cout &lt;&lt; <span style="color: #2aa198;">"I am class two"</span> &lt;&lt; endl; }
<span class="linenr">60: </span>};
<span class="linenr">61: </span>
<span class="linenr">62: </span><span style="color: #cb4b16;">#endif</span> <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">CPPFACTORY_DERIVEDCLASSTWO_H</span>
</pre>
</div>
</div>
</div>
