C++/objectfactory.org
** A First Attempt at the Factory Method

   A simple solution to the implementation of the factory method would
   be something like this:

#+BEGIN_SRC cpp +n -r
  #include "MyFactorySimple.h"

  #include "DerivedClassOne.h"
  #include "DerivedClassTwo.h"

  shared_ptr<MyBaseClass> MyFactory::CreateInstance(string name)
  {
          MyBaseClass * instance = nullptr;

          if(name == "one")
                  instance = new DerivedClassOne();

          if(name == "two")
                  instance = new DerivedClassTwo();

          if(instance != nullptr)
                  return std::shared_ptr<MyBaseClass>(instance);
          else
                  return nullptr;
  }
#+END_SRC

   The factory determines which concrete class to create and has
   knowledge of every class via the class headers.

** Running the Application

   A simple main function is now needed so that we can test our
   implementation:

#+BEGIN_SRC cpp +n -r
  #include "MyFactorySimple.h"

  int main(int argc, char** argv)
  {
      auto instanceOne = MyFactory::CreateInstance("one");
      auto instanceTwo = MyFactory::CreateInstance("two");

      instanceOne->doSomething();
      instanceTwo->doSomething();

      return 0;
  }
#+END_SRC

   A Visual Studio Project (SimpleFactory.vcxproj) is included with
   the source code accompanying this article which can be built and
   run giving the following output:

#+BEGIN_SRC 
I am class one
I am class two
#+END_SRC

* Problems with the Simple Solution

  On the surface this looks like a good solution and it possibly is in
  some cases. However, what happens if we have a lot of classes
  deriving from MyBaseClass? We keep having to add the includes and
  the compare - construct code. The problem now is that the factory
  has an explicit dependency on all the derived classes, which is not
  ideal. We need to come up with a better solution; one that removes
  the need for constantly adding to the MyFactory::Create. This is
  where the idea of a registry of factory methods can help us.

