C++/objectfactory.html

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">A First Attempt at the Factory Method</h3>
<div class="outline-text-3" id="text-2-4">
<p>
A simple solution to the implementation of the factory method would
be something like this:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">63: </span><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">"MyFactorySimple.h"</span>
<span class="linenr">64: </span>
<span class="linenr">65: </span><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">"DerivedClassOne.h"</span>
<span class="linenr">66: </span><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">"DerivedClassTwo.h"</span>
<span class="linenr">67: </span>
<span class="linenr">68: </span><span style="color: #b58900;">shared_ptr</span>&lt;MyBaseClass&gt; <span style="color: #2aa198;">MyFactory</span>::<span style="color: #268bd2;">CreateInstance</span>(<span style="color: #b58900;">string</span> <span style="color: #268bd2;">name</span>)
<span class="linenr">69: </span>{
<span class="linenr">70: </span>        <span style="color: #b58900;">MyBaseClass</span> * <span style="color: #268bd2;">instance</span> = nullptr;
<span class="linenr">71: </span>
<span class="linenr">72: </span>        <span style="color: #859900;">if</span>(name == <span style="color: #2aa198;">"one"</span>)
<span class="linenr">73: </span>                instance = <span style="color: #859900;">new</span> <span style="color: #b58900;">DerivedClassOne</span>();
<span class="linenr">74: </span>
<span class="linenr">75: </span>        <span style="color: #859900;">if</span>(name == <span style="color: #2aa198;">"two"</span>)
<span class="linenr">76: </span>                instance = <span style="color: #859900;">new</span> <span style="color: #b58900;">DerivedClassTwo</span>();
<span class="linenr">77: </span>
<span class="linenr">78: </span>        <span style="color: #859900;">if</span>(instance != nullptr)
<span class="linenr">79: </span>                <span style="color: #859900;">return</span> <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">MyBaseClass</span>&gt;(<span style="color: #268bd2;">instance</span>);
<span class="linenr">80: </span>        <span style="color: #859900;">else</span>
<span class="linenr">81: </span>                <span style="color: #859900;">return</span> nullptr;
<span class="linenr">82: </span>}
</pre>
</div>

<p>
The factory determines which concrete class to create and has
knowledge of every class via the class headers.
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Running the Application</h3>
<div class="outline-text-3" id="text-2-5">
<p>
A simple main function is now needed so that we can test our
implementation:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">83: </span><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">"MyFactorySimple.h"</span>
<span class="linenr">84: </span>
<span class="linenr">85: </span><span style="color: #b58900;">int</span> <span style="color: #268bd2;">main</span>(<span style="color: #b58900;">int</span> <span style="color: #268bd2;">argc</span>, <span style="color: #b58900;">char</span>** <span style="color: #268bd2;">argv</span>)
<span class="linenr">86: </span>{
<span class="linenr">87: </span>    <span style="color: #859900;">auto</span> <span style="color: #b58900;">instanceOne</span> = <span style="color: #2aa198;">MyFactory</span>::CreateInstance(<span style="color: #2aa198;">"one"</span>);
<span class="linenr">88: </span>    <span style="color: #859900;">auto</span> <span style="color: #b58900;">instanceTwo</span> = <span style="color: #2aa198;">MyFactory</span>::CreateInstance(<span style="color: #2aa198;">"two"</span>);
<span class="linenr">89: </span>
<span class="linenr">90: </span>    instanceOne-&gt;doSomething();
<span class="linenr">91: </span>    instanceTwo-&gt;doSomething();
<span class="linenr">92: </span>
<span class="linenr">93: </span>    <span style="color: #859900;">return</span> 0;
<span class="linenr">94: </span>}
</pre>
</div>

<p>
A Visual Studio Project (SimpleFactory.vcxproj) is included with
the source code accompanying this article which can be built and
run giving the following output:
</p>

<pre class="example">
I am class one
I am class two
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Problems with the Simple Solution</h2>
<div class="outline-text-2" id="text-3">
<p>
On the surface this looks like a good solution and it possibly is in
some cases. However, what happens if we have a lot of classes
deriving from MyBaseClass? We keep having to add the includes and
the compare - construct code. The problem now is that the factory
has an explicit dependency on all the derived classes, which is not
ideal. We need to come up with a better solution; one that removes
the need for constantly adding to the MyFactory::Create. This is
where the idea of a registry of factory methods can help us.
</p>
</div>
</div>
