C++/objectfactory.org
* A Revised Factory Class

  One of our main objectives is to remove the dependencies on the
  derived classes from the factory. However, we still need to allow
  the factory to trigger the creation of instances. One way to do this
  is for the main factory class to maintain a registry of factory
  functions that can be defined elsewhere. When the factory class
  needs to create an instance of a derived class, it can look up the
  factory function in this registry. The registry is defined as
  follows:

#+BEGIN_SRC cpp +n -r
  map<string, function<MyBaseClass*(void)>> factoryFunctionRegistry;
#+END_SRC

  It is a map, keyed on a string with values as functions that return
  a pointer to an instance of a class based on MyBaseClass. We can
  then have a method on MyFactory which can add a factory function to
  the registry:

#+BEGIN_SRC cpp +n -r
  void MyFactory::RegisterFactoryFunction(string name,
          function<MyBaseClass*(void)> classFactoryFunction)
  {
          // register the class factory function
          factoryFunctionRegistry[name] = classFactoryFunction;
  }
#+END_SRC
   
  The Create method can then be changed as follows:

#+BEGIN_SRC cpp +n -r
  shared_ptr<MyBaseClass> MyFactory::Create(string name)
  {
          MyBaseClass * instance = nullptr;

          // find name in the registry and call factory method.
          auto it = factoryFunctionRegistry.find(name);
          if(it != factoryFunctionRegistry.end())
                  instance = it->second();

          // wrap instance in a shared ptr and return
          if(instance != nullptr)
                  return std::shared_ptr<MyBaseClass>(instance);
          else
                  return nullptr;
  }
#+END_SRC

  So how do we go about registering the classes in a way that keeps
  dependencies to a minimum? We cannot easily have instances of the
  derived classes register themselves as we can't create instances
  without the class being registered. The fact that we need the class
  registered, not the object gives us a hint that we may need some
  static variables or members to do this. I stress that the way I am
  going to do this may not be the best in all scenarios. I am deeply
  suspicious of static variables and members, as static initialisation
  can be a minefield. However, I will press on, as the solution serves
  the purpose of this example and it is up to the reader to determine
  whether a solution they use needs to follow different rules and
  design. Firstly we define a method on MyFactory to obtain the
  singleton instance:

#+BEGIN_SRC cpp +n -r
  yFactory * MyFactory::Instance()
  {
          static MyFactory factory;
          return &factory;
  }
#+END_SRC

  We cannot call the following from the global context:

#+BEGIN_SRC cpp +n -r
  MyFactory::Instance()->RegisterFactoryFunction(name, classFactoryFunction);
#+END_SRC

  I have therefore created a Registrar class that will do the call for
  us in it's constructor:

#+BEGIN_SRC cpp +n -r
  class Registrar {
  public:
          Registrar(string className, function<MyBaseClass*(void)> classFactoryFunction);
  };
  ...
  Registrar::Registrar(string name, function<MyBaseClass*(void)> classFactoryFunction)
  {
          // register the class factory function 
          MyFactory::Instance()->RegisterFactoryFunction(name, classFactoryFunction);
  }
#+END_SRC

  Once we have this, we can create static instances of this in the
  source files of the derived classes as follows (DerivedClassOne):

#+BEGIN_SRC cpp +n -r
  static Registrar registrar("one",
      [](void) -> MyBaseClass * { return new DervedClassOne();});
#+END_SRC

  As it turns out, this code can be duplicated in all derived classes
  so a quick pre processor define as follows:

#+BEGIN_SRC cpp +n -r
  #define REGISTER_CLASS(NAME, TYPE) \
          static Registrar registrar(NAME, \
               [](void) -> MyBaseClass * { return new TYPE();});
#+END_SRC

  This uses C++ lambda support to declare anonymous
  functions. We then only need add the following to each derived class
  source file:

#+BEGIN_SRC cpp +n -r
  REGISTER_CLASS("one", DerivedClassOne);
#+END_SRC

