C++/objectfactory.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">A Revised Factory Class</h2>
<div class="outline-text-2" id="text-4">
<p>
One of our main objectives is to remove the dependencies on the
derived classes from the factory. However, we still need to allow
the factory to trigger the creation of instances. One way to do this
is for the main factory class to maintain a registry of factory
functions that can be defined elsewhere. When the factory class
needs to create an instance of a derived class, it can look up the
factory function in this registry. The registry is defined as
follows:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">95: </span>map&lt;string, function&lt;MyBaseClass*(<span style="color: #b58900;">void</span>)&gt;&gt; factoryFunctionRegistry;
</pre>
</div>

<p>
It is a map, keyed on a string with values as functions that return
a pointer to an instance of a class based on MyBaseClass. We can
then have a method on MyFactory which can add a factory function to
the registry:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr"> 96: </span><span style="color: #b58900;">void</span> <span style="color: #2aa198;">MyFactory</span>::<span style="color: #268bd2;">RegisterFactoryFunction</span>(<span style="color: #b58900;">string</span> <span style="color: #268bd2;">name</span>,
<span class="linenr"> 97: </span>        <span style="color: #b58900;">function</span>&lt;MyBaseClass*(<span style="color: #b58900;">void</span>)&gt; <span style="color: #268bd2;">classFactoryFunction</span>)
<span class="linenr"> 98: </span>{
<span class="linenr"> 99: </span>        <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">register the class factory function</span>
<span class="linenr">100: </span>        factoryFunctionRegistry[name] = classFactoryFunction;
<span class="linenr">101: </span>}
</pre>
</div>

<p>
The Create method can then be changed as follows:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">102: </span><span style="color: #b58900;">shared_ptr</span>&lt;MyBaseClass&gt; <span style="color: #2aa198;">MyFactory</span>::<span style="color: #268bd2;">Create</span>(<span style="color: #b58900;">string</span> <span style="color: #268bd2;">name</span>)
<span class="linenr">103: </span>{
<span class="linenr">104: </span>        <span style="color: #b58900;">MyBaseClass</span> * <span style="color: #268bd2;">instance</span> = nullptr;
<span class="linenr">105: </span>
<span class="linenr">106: </span>        <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">find name in the registry and call factory method.</span>
<span class="linenr">107: </span>        <span style="color: #859900;">auto</span> <span style="color: #b58900;">it</span> = factoryFunctionRegistry.find(name);
<span class="linenr">108: </span>        <span style="color: #859900;">if</span>(it != factoryFunctionRegistry.end())
<span class="linenr">109: </span>                instance = it-&gt;second();
<span class="linenr">110: </span>
<span class="linenr">111: </span>        <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">wrap instance in a shared ptr and return</span>
<span class="linenr">112: </span>        <span style="color: #859900;">if</span>(instance != nullptr)
<span class="linenr">113: </span>                <span style="color: #859900;">return</span> <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">MyBaseClass</span>&gt;(<span style="color: #268bd2;">instance</span>);
<span class="linenr">114: </span>        <span style="color: #859900;">else</span>
<span class="linenr">115: </span>                <span style="color: #859900;">return</span> nullptr;
<span class="linenr">116: </span>}
</pre>
</div>

<p>
So how do we go about registering the classes in a way that keeps
dependencies to a minimum? We cannot easily have instances of the
derived classes register themselves as we can't create instances
without the class being registered. The fact that we need the class
registered, not the object gives us a hint that we may need some
static variables or members to do this. I stress that the way I am
going to do this may not be the best in all scenarios. I am deeply
suspicious of static variables and members, as static initialisation
can be a minefield. However, I will press on, as the solution serves
the purpose of this example and it is up to the reader to determine
whether a solution they use needs to follow different rules and
design. Firstly we define a method on MyFactory to obtain the
singleton instance:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">117: </span><span style="color: #b58900;">yFactory</span> * <span style="color: #2aa198;">MyFactory</span>::<span style="color: #268bd2;">Instance</span>()
<span class="linenr">118: </span>{
<span class="linenr">119: </span>        <span style="color: #859900;">static</span> <span style="color: #b58900;">MyFactory</span> <span style="color: #268bd2;">factory</span>;
<span class="linenr">120: </span>        <span style="color: #859900;">return</span> &amp;factory;
<span class="linenr">121: </span>}
</pre>
</div>

<p>
We cannot call the following from the global context:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">122: </span><span style="color: #2aa198;">MyFactory</span>::Instance()-&gt;RegisterFactoryFunction(name, classFactoryFunction);
</pre>
</div>

<p>
I have therefore created a Registrar class that will do the call for
us in it's constructor:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">123: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">Registrar</span> {
<span class="linenr">124: </span><span style="color: #859900;">public</span>:
<span class="linenr">125: </span>        <span style="color: #268bd2;">Registrar</span>(<span style="color: #b58900;">string</span> <span style="color: #268bd2;">className</span>, <span style="color: #b58900;">function</span>&lt;MyBaseClass*(<span style="color: #b58900;">void</span>)&gt; <span style="color: #268bd2;">classFactoryFunction</span>);
<span class="linenr">126: </span>};
<span class="linenr">127: </span>...
<span class="linenr">128: </span><span style="color: #2aa198;">Registrar</span>::<span style="color: #268bd2;">Registrar</span>(<span style="color: #b58900;">string</span> <span style="color: #268bd2;">name</span>, <span style="color: #b58900;">function</span>&lt;MyBaseClass*(<span style="color: #b58900;">void</span>)&gt; <span style="color: #268bd2;">classFactoryFunction</span>)
<span class="linenr">129: </span>{
<span class="linenr">130: </span>        <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">register the class factory function </span>
<span class="linenr">131: </span>        <span style="color: #2aa198;">MyFactory</span>::Instance()-&gt;RegisterFactoryFunction(name, classFactoryFunction);
<span class="linenr">132: </span>}
</pre>
</div>

<p>
Once we have this, we can create static instances of this in the
source files of the derived classes as follows (DerivedClassOne):
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">133: </span><span style="color: #859900;">static</span> <span style="color: #b58900;">Registrar</span> <span style="color: #268bd2;">registrar</span>(<span style="color: #2aa198;">"one"</span>,
<span class="linenr">134: </span>    [](<span style="color: #b58900;">void</span>) -&gt; MyBaseClass * { <span style="color: #859900;">return</span> <span style="color: #859900;">new</span> <span style="color: #b58900;">DervedClassOne</span>();});
</pre>
</div>

<p>
As it turns out, this code can be duplicated in all derived classes
so a quick pre processor define as follows:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">135: </span><span style="color: #cb4b16;">#define</span> <span style="color: #268bd2;">REGISTER_CLASS</span>(<span style="color: #268bd2;">NAME</span>, <span style="color: #268bd2;">TYPE</span>) \
<span class="linenr">136: </span>        <span style="color: #859900;">static</span> <span style="color: #b58900;">Registrar</span> <span style="color: #268bd2;">registrar</span>(NAME, \
<span class="linenr">137: </span>             [](<span style="color: #b58900;">void</span>) -&gt; MyBaseClass * { <span style="color: #859900;">return</span> <span style="color: #859900;">new</span> <span style="color: #b58900;">TYPE</span>();});
</pre>
</div>

<p>
This uses C++ lambda support to declare anonymous
functions. We then only need add the following to each derived class
source file:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">138: </span>REGISTER_CLASS(<span style="color: #2aa198;">"one"</span>, DerivedClassOne);
</pre>
</div>
</div>
</div>
